handouts/types-and-strings.org
#+title:  Types and strings
#+author: Patrick D. Elliott
#+LATEX_HEADER_EXTRA: \input{slides-boilerplate}
#+EXPORT_FILE_NAME: ../docs/types-and-strings.html
#+BEAMER_THEME: metropolis
#+BEAMER_COLOR_THEME: owl [snowy]
#+BEAMER_HEADER: \input{beamerplate.tex}
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+EXPORT_FILE_NAME: ./docs/types-and-strings.html
#+BEAMER_FONT_THEME: professionalfonts
#+LATEX_COMPILER: xelatex
#+OPTIONS: toc:nil H:2

** Gameplan

- Next week we'll finish our initial survey of the very basics of Haskell, by talking more about types and typeclasses.
- In the following couple of weeks (May 2; May 9) we'll start implementing some basic natural language fragments in haskell, following the textbook /Computational Semantics with Functional Programming/ [cite:@vanEijckUnger2010].
  * Note: you should be able to access this textbook electronically via the HHU library.

** Homework

- Do the /building functions/ exercises at the end of chapter 3 (p83-85)
- Do chapter exercises 1-10 at the end of chapter 4.
- Optionally read chapter 3 and 4 of /Haskell from first principles/ (skip 4.4, on numeric types).
  

* Types and strings
  
** Types in formal semantics

Types in Haskell are a way of /categorizing values/; they provide a syntactic restriction on how complex expressions are built.

You might be familiar with types if you've ever taken a semantics course before.

- /is happy/: \(\langle e,t \rangle\)
- /Henning/: \(e\)
- /and/ : \(\langle t, \langle t, t\rangle\rangle\)
  
Note that formal semantics often uses a different convention for functional types, but it's easy to translate between the two:

\[\langle a,b \rangle := a \to b\]
  
** Types in Haskell 

- Haskell has a more complex and powerful type-system than the one you might be used to from formal semantics. 
  * Formal semantics typically uses the /simply-typed lambda calculus/ as a basis.
  * Haskell is based on System F, i.e., the /polymorphic lambda calculus/, which allows for universal quantification over types.
  * Various /language extensions/ exist to make Haskell's type system even more powerful (dependent types, linear types, etc).
  * In this course, we won't go beyond anything expressible in the polymorphic lambda calculus. 
    
** Getting information about types

You can find out the type of any haskell expression quite easily using the ~:type~ command in GHCi:

#+begin_src haskell
  ghci> :t "hello haskell!"
  "hello haskell!" :: String
  ghci> :t 'a'
  'a' :: Char
#+end_src

- Note that single characters are enclosed in single quotes.
- The double colon ~::~ is interpreted as /has the type/.
  
** Type annotations

We explicitly annotate expressons with their type using ~::~. 

#+begin_src haskell
  ghci> :t ("hello haskell!" :: String)
  "hello haskell!" :: String
#+end_src

If we annotate an expression with the wrong type, we'll get an error:

#+begin_src haskell
ghci> :t ("hello haskell!" :: Char)
<interactive>:1:2: error:
    • Couldn't match type ‘[Char]’ with ‘Char’
      Expected: Char
        Actual: String
#+end_src

** String types

~String~ is actually a name for a /complex type/, ~[Char]~.

That is to say, strings in haskell are actually just /lists of characters/.

In general, for any type ~a~, the type ~[a]~ is the type of a list of things of type ~a~.

** Printing strings

We can print strings to the standard output in GHCi using the ~putStrLn~ or ~putStr~ functions.

#+begin_src haskell
ghci> putStrLn "hello haskell!"
hello haskell!
#+end_src

Examine the type of ~putStrLn~. You'll notice something quite interesting.

#+begin_src haskell
ghci> :t putStrLn
putStrLn :: String -> IO ()
#+end_src

In Haskell, we use arrow notation for function types (we'll come back to this later). ~IO ()~ is a special type to indicate that the program has some effect beyond evaluation of functions and arguments.

** Printing strings from a source file

#+begin_src haskell
    -- print1.hs

  module Print1 where

  main :: IO ()
  main = putStrLn "hello world!"
#+end_src

If we load ~print1.hs~ from GHCi and execute ~main~, /hello world!/ will be printed to the standard output.

** The ~main~ function

In haskell ~main~ is the default action when building an executable, or running it in GHCi, and it must always be of type ~IO ()~.

#+begin_src haskell
putStrLn :: String -> IO ()
#+end_src

Input/output is much more complicated in Haskell than in most other programming languages, since it involves exploiting Haskell's type system to reason about /side effects/. This will be a topic for later in the semester.

