docs/types-and-strings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-18 Tue 14:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Types and strings</title>
<meta name="author" content="Patrick D. Elliott" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Types and strings</h1>

<div id="outline-container-orgfe8aeea" class="outline-3">
<h3 id="orgfe8aeea"><span class="section-number-3">0.1.</span> Gameplan</h3>
<div class="outline-text-3" id="text-0-1">
<ul class="org-ul">
<li>Next week we'll finish our initial survey of the very basics of Haskell, by talking more about types and typeclasses.</li>
<li>In the following couple of weeks (May 2; May 9) we'll start implementing some basic natural language fragments in haskell, following the textbook <i>Computational Semantics with Functional Programming</i> (van Eijck, Jan and Unger, Christina, 2010).
<ul class="org-ul">
<li>Note: you should be able to access this textbook electronically via the HHU library.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org47ea0c7" class="outline-3">
<h3 id="org47ea0c7"><span class="section-number-3">0.2.</span> Homework</h3>
<div class="outline-text-3" id="text-0-2">
<ul class="org-ul">
<li>Do the <i>building functions</i> exercises at the end of chapter 3 (p83-85)</li>
<li>Do chapter exercises 1-10 at the end of chapter 4.</li>
<li>Optionally read chapter 3 and 4 of <i>Haskell from first principles</i> (skip 4.4, on numeric types).</li>
</ul>
</div>
</div>


<div id="outline-container-org247855a" class="outline-2">
<h2 id="org247855a"><span class="section-number-2">1.</span> Types and strings</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org19dd25c" class="outline-3">
<h3 id="org19dd25c"><span class="section-number-3">1.1.</span> Types in formal semantics</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Types in Haskell are a way of <i>categorizing values</i>; they provide a syntactic restriction on how complex expressions are built.
</p>

<p>
You might be familiar with types if you've ever taken a semantics course before.
</p>

<ul class="org-ul">
<li><i>is happy</i>: \(\langle e,t \rangle\)</li>
<li><i>Henning</i>: \(e\)</li>
<li><i>and</i> : \(\langle t, \langle t, t\rangle\rangle\)</li>
</ul>

<p>
Note that formal semantics often uses a different convention for functional types, but it's easy to translate between the two:
</p>

<p>
\[\langle a,b \rangle := a \to b\]
</p>
</div>
</div>

<div id="outline-container-orge546305" class="outline-3">
<h3 id="orge546305"><span class="section-number-3">1.2.</span> Types in Haskell</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Haskell has a more complex and powerful type-system than the one you might be used to from formal semantics. 
<ul class="org-ul">
<li>Formal semantics typically uses the <i>simply-typed lambda calculus</i> as a basis.</li>
<li>Haskell is based on System F, i.e., the <i>polymorphic lambda calculus</i>, which allows for universal quantification over types.</li>
<li>Various <i>language extensions</i> exist to make Haskell's type system even more powerful (dependent types, linear types, etc).</li>
<li>In this course, we won't go beyond anything expressible in the polymorphic lambda calculus.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org218fbe6" class="outline-3">
<h3 id="org218fbe6"><span class="section-number-3">1.3.</span> Getting information about types</h3>
<div class="outline-text-3" id="text-1-3">
<p>
You can find out the type of any haskell expression quite easily using the <code>:type</code> command in GHCi:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t <span style="color: #a6e3a1;">"hello haskell!"</span>
<span style="color: #a6e3a1;">"hello haskell!"</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">String</span>
ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t <span style="color: #a6e3a1;">'a'</span>
<span style="color: #a6e3a1;">'a'</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">Char</span>
</pre>
</div>

<ul class="org-ul">
<li>Note that single characters are enclosed in single quotes.</li>
<li>The double colon <code>::</code> is interpreted as <i>has the type</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-org17748fa" class="outline-3">
<h3 id="org17748fa"><span class="section-number-3">1.4.</span> Type annotations</h3>
<div class="outline-text-3" id="text-1-4">
<p>
We explicitly annotate expressons with their type using <code>::</code>. 
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t (<span style="color: #a6e3a1;">"hello haskell!"</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">String</span>)
<span style="color: #a6e3a1;">"hello haskell!"</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">String</span>
</pre>
</div>

<p>
If we annotate an expression with the wrong type, we'll get an error:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t (<span style="color: #a6e3a1;">"hello haskell!"</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">Char</span>)
<span style="color: #89dceb;">&lt;</span>interactive<span style="color: #89dceb;">&gt;:</span>1<span style="color: #cba6f7;">:</span>2<span style="color: #cba6f7;">:</span> error<span style="color: #cba6f7;">:</span>
    <span style="color: #89dceb;">&#8226;</span> <span style="color: #cba6f7;">Couldn't</span> match <span style="color: #cba6f7;">type</span> &#8216;[<span style="color: #b4befe;">Char</span>]&#8217; with &#8216;<span style="color: #b4befe;">Char</span>&#8217;
      <span style="color: #cba6f7;">Expected:</span> <span style="color: #cba6f7;">Char</span>
        <span style="color: #cba6f7;">Actual:</span> <span style="color: #cba6f7;">String</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org26b436f" class="outline-3">
<h3 id="org26b436f"><span class="section-number-3">1.5.</span> String types</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<code>String</code> is actually a name for a <i>complex type</i>, <code>[Char]</code>.
</p>

<p>
That is to say, strings in haskell are actually just <i>lists of characters</i>.
</p>

<p>
In general, for any type <code>a</code>, the type <code>[a]</code> is the type of a list of things of type <code>a</code>.
</p>
</div>
</div>

<div id="outline-container-org3ea8441" class="outline-3">
<h3 id="org3ea8441"><span class="section-number-3">1.6.</span> Printing strings</h3>
<div class="outline-text-3" id="text-1-6">
<p>
We can print strings to the standard output in GHCi using the <code>putStrLn</code> or <code>putStr</code> functions.
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> putStrLn <span style="color: #a6e3a1;">"hello haskell!"</span>
<span style="color: #89b4fa;">hello</span> haskell<span style="color: #89dceb;">!</span>
</pre>
</div>

<p>
Examine the type of <code>putStrLn</code>. You'll notice something quite interesting.
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>t putStrLn
<span style="color: #89b4fa;">putStrLn</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">String</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">IO</span> <span style="color: #cba6f7;">()</span>
</pre>
</div>

<p>
In Haskell, we use arrow notation for function types (we'll come back to this later). <code>IO ()</code> is a special type to indicate that the program has some effect beyond evaluation of functions and arguments.
</p>
</div>
</div>

<div id="outline-container-org91179bc" class="outline-3">
<h3 id="org91179bc"><span class="section-number-3">1.7.</span> Printing strings from a source file</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-haskell">  <span style="color: #585b70;">-- </span><span style="color: #585b70;">print1.hs</span>

<span style="color: #cba6f7;">module</span> <span style="color: #cba6f7;">Print1</span> <span style="color: #cba6f7;">where</span>

<span style="color: #89b4fa;">main</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">IO</span> <span style="color: #cba6f7;">()</span>
<span style="color: #89b4fa;">main</span> <span style="color: #89dceb;">=</span> putStrLn <span style="color: #a6e3a1;">"hello world!"</span>
</pre>
</div>

<p>
If we load <code>print1.hs</code> from GHCi and execute <code>main</code>, <i>hello world!</i> will be printed to the standard output.
</p>
</div>
</div>

<div id="outline-container-org828a8b7" class="outline-3">
<h3 id="org828a8b7"><span class="section-number-3">1.8.</span> The <code>main</code> function</h3>
<div class="outline-text-3" id="text-1-8">
<p>
In haskell <code>main</code> is the default action when building an executable, or running it in GHCi, and it must always be of type <code>IO ()</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">putStrLn</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">String</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">IO</span> <span style="color: #cba6f7;">()</span>
</pre>
</div>

<p>
Input/output is much more complicated in Haskell than in most other programming languages, since it involves exploiting Haskell's type system to reason about <i>side effects</i>. This will be a topic for later in the semester.
</p>
</div>
</div>
