handouts/types-and-strings.org
** Concatenating strings

There are two functions for concatenating strings in the haskell prelude:

#+begin_src haskell
  (++) :: [a] -> [a] -> [a]
  concat :: [[a]] -> [a]
#+end_src

- ~++~ is an infix operator, whereas ~concat~ is just an ordinary function.
- Note that ~a~ in the type signature is a /type variable/. Free variables in type signatures are implicitly universally quantified in Haskell.
- This means that both ~++~ and ~concat~ are /polymorphic/ functions; they can be used to combine lists more generally.
  
** Types primer i 

In formal semantics, functional types are often written using angled-brackets (e.g., \(\langle e,t \rangle\)), following the convention used by [cite:@HeimKratzer1998].

Haskell uses arrow notation, which is more commonly found in the computer science/programming language literature, although some semantics texts use arrow notation [cite:@Carpenter1998].

Arrow notation in Haskell is /right associative/:

- ~a -> b -> c~ \(\iff \) ~a -> (b -> c)~
  
** Types primer ii

Let's look again at the type for list concatenation:

#+begin_src haskell
  (++) :: [a] -> [a] -> [a]
#+end_src

- ~(->)~ is a type /constructor/. It takes two types ~a~, ~b~ and returns the type of a function from \(a\)s to \(b\)s.
- One important feature of haskell is the possibility of defining arbitrary constructors; ~([.])~ takes a type ~a~ and returns the type of a list of \(a\)s.
- Remember, free type variables are implicitly universally quanitified, which means that list concatenation is defined for something of type ~[a]~, where ~a~ can be /any type/.

** Strings as lists of chars  

#+begin_src haskell
  "hello haskell!"
  ['h','e','l','l','o',' ','h','a','s','k','e','l','l','!']
#+end_src

- Strings surrounded by double quotes are really just /syntactic sugar/ for lists of characters.
- Syntactic sugar is just a notational convention built into the language that makes our lives as programmers easier.
- Lists are actually also syntactic sugar! We'll learn what lists really are in a bit.
 
** Polymorphism

What do you think the following evaluates to?

#+begin_src haskell
[1,2,3] ++ [4,5,6]
#+end_src

What happens if we try to evaluate the following:

#+begin_src haskell
"hello" ++ [4,5,6]
#+end_src

** More list manipulation

#+begin_src haskell
  ghci> head "Henning"
  'H'
  ghci> tail "Henning"
  "enning"
  ghci> take 0 "Henning"
  ""
  ghci> take 3 "Henning"
  "Hen"
  ghci> drop 3 "Henning"
  "ning"
  ghci> "Henning" !! 2
  'n'
#+end_src

** Totality and safety

What happens when you run the following in GHCi:

#+begin_src haskell
ghci> "yo" !! 2
#+end_src

Let's examine the type of ~!!~; as expected, its a function from a list of \(a\)s, to an integer, to an \(a\).

#+begin_src haskell
(!!) :: [a] -> Int -> a
#+end_src

Note however, that this isn't a /total/ function; there are some lists and integers for which this function will be undefined.

Partial functions in haskell are considered /unsafe/, because the type system doesn't prevent us from providing an illicit value as an argument to the function.

** A note on safety

In Haskell, it's good practice to avoid unsafe functions wherever possible.

This is because the type-checker is an extremely powerful programming aid - if a program type-checks successfully, we can generally be reasonably sure that it will run without any errors and give back a sensible result.

This promise only holds just so long as we use /total/ functions. There is some neat type-level machinery in haskell to rewrite functions like ~(!!)~ as total functions which we'll learn about later in the semester!

** Building lists with ~cons~

The final list manipulation function we'll look at is an important one: ~cons~.

#+begin_src haskell
  ghci> 'h' : []
  [h]
  ghci> 'h' : "enning"
  "henning"
#+end_src

In haskell, lists are built up by successive application of ~cons~:

#+begin_src haskell
  'h' : ('e' : ('n' : ('n' : ('i' : ('n' : ('g' : []))))))
#+end_src

Since ~:~ is right associative we can drop the parentheses.

Lists in haskell are therefore /singly-linked lists of characters/.

** Singly-linked lists

#+begin_export latex
\begin{center}
\begin{forest}
  \texttt
  [{:}
    [{j}]
    [{:}
      [{o}]
      [{:}
        [{s}]
        [{:}
          [{i}]
          [{:}
            [{e}]
            [{[]}]
            ]
          ]
        ]
    ]
    ]
  \end{forest}
  \end{center}
#+end_export

** An aside on performance

- For most industrial applications, singly-linked lists of chars would be a terrible choice.
- On the other hand, this means that strings "come for free" on the basis of chars and extremely general list manipulation functions. 
- For anything we do in this class, performance won't be an issue. For serious work with strings, the standard is the Haskell ~text~ library.

* Prolegomenon to types

