docs/types-and-strings.html

<div id="outline-container-org33df953" class="outline-3">
<h3 id="org33df953"><span class="section-number-3">1.9.</span> Concatenating strings</h3>
<div class="outline-text-3" id="text-1-9">
<p>
There are two functions for concatenating strings in the haskell prelude:
</p>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #89b4fa;">++</span>) <span style="color: #89dceb;">::</span> [a] <span style="color: #89dceb;">-&gt;</span> [a] <span style="color: #89dceb;">-&gt;</span> [a]
<span style="color: #89b4fa;">concat</span> <span style="color: #89dceb;">::</span> [[a]] <span style="color: #89dceb;">-&gt;</span> [a]
</pre>
</div>

<ul class="org-ul">
<li><code>++</code> is an infix operator, whereas <code>concat</code> is just an ordinary function.</li>
<li>Note that <code>a</code> in the type signature is a <i>type variable</i>. Free variables in type signatures are implicitly universally quantified in Haskell.</li>
<li>This means that both <code>++</code> and <code>concat</code> are <i>polymorphic</i> functions; they can be used to combine lists more generally.</li>
</ul>
</div>
</div>

<div id="outline-container-orge942cc1" class="outline-3">
<h3 id="orge942cc1"><span class="section-number-3">1.10.</span> Types primer i</h3>
<div class="outline-text-3" id="text-1-10">
<p>
In formal semantics, functional types are often written using angled-brackets (e.g., \(\langle e,t \rangle\)), following the convention used by (Heim, Irene and Kratzer, Angelika, 1998).
</p>

<p>
Haskell uses arrow notation, which is more commonly found in the computer science/programming language literature, although some semantics texts use arrow notation (Carpenter, Bob, 1998).
</p>

<p>
Arrow notation in Haskell is <i>right associative</i>:
</p>

<ul class="org-ul">
<li><code>a -&gt; b -&gt; c</code> \(\iff \) <code>a -&gt; (b -&gt; c)</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgd19bfb2" class="outline-3">
<h3 id="orgd19bfb2"><span class="section-number-3">1.11.</span> Types primer ii</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Let's look again at the type for list concatenation:
</p>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #89b4fa;">++</span>) <span style="color: #89dceb;">::</span> [a] <span style="color: #89dceb;">-&gt;</span> [a] <span style="color: #89dceb;">-&gt;</span> [a]
</pre>
</div>

<ul class="org-ul">
<li><code>(-&gt;)</code> is a type <i>constructor</i>. It takes two types <code>a</code>, <code>b</code> and returns the type of a function from \(a\)s to \(b\)s.</li>
<li>One important feature of haskell is the possibility of defining arbitrary constructors; <code>([.])</code> takes a type <code>a</code> and returns the type of a list of \(a\)s.</li>
<li>Remember, free type variables are implicitly universally quanitified, which means that list concatenation is defined for something of type <code>[a]</code>, where <code>a</code> can be <i>any type</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-org8e66f00" class="outline-3">
<h3 id="org8e66f00"><span class="section-number-3">1.12.</span> Strings as lists of chars</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #a6e3a1;">"hello haskell!"</span>
[<span style="color: #a6e3a1;">'h'</span>,<span style="color: #a6e3a1;">'e'</span>,<span style="color: #a6e3a1;">'l'</span>,<span style="color: #a6e3a1;">'l'</span>,<span style="color: #a6e3a1;">'o'</span>,<span style="color: #a6e3a1;">' '</span>,<span style="color: #a6e3a1;">'h'</span>,<span style="color: #a6e3a1;">'a'</span>,<span style="color: #a6e3a1;">'s'</span>,<span style="color: #a6e3a1;">'k'</span>,<span style="color: #a6e3a1;">'e'</span>,<span style="color: #a6e3a1;">'l'</span>,<span style="color: #a6e3a1;">'l'</span>,<span style="color: #a6e3a1;">'!'</span>]
</pre>
</div>

<ul class="org-ul">
<li>Strings surrounded by double quotes are really just <i>syntactic sugar</i> for lists of characters.</li>
<li>Syntactic sugar is just a notational convention built into the language that makes our lives as programmers easier.</li>
<li>Lists are actually also syntactic sugar! We'll learn what lists really are in a bit.</li>
</ul>
</div>
</div>

<div id="outline-container-orgeff6e14" class="outline-3">
<h3 id="orgeff6e14"><span class="section-number-3">1.13.</span> Polymorphism</h3>
<div class="outline-text-3" id="text-1-13">
<p>
What do you think the following evaluates to?
</p>

<div class="org-src-container">
<pre class="src src-haskell">[1,2,3] <span style="color: #89dceb;">++</span> [4,5,6]
</pre>
</div>

<p>
What happens if we try to evaluate the following:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #a6e3a1;">"hello"</span> <span style="color: #89dceb;">++</span> [4,5,6]
</pre>
</div>
</div>
</div>

<div id="outline-container-org1142e25" class="outline-3">
<h3 id="org1142e25"><span class="section-number-3">1.14.</span> More list manipulation</h3>
<div class="outline-text-3" id="text-1-14">
<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> head <span style="color: #a6e3a1;">"Henning"</span>
<span style="color: #a6e3a1;">'H'</span>
ghci<span style="color: #89b4fa;">&gt;</span> tail <span style="color: #a6e3a1;">"Henning"</span>
<span style="color: #a6e3a1;">"enning"</span>
ghci<span style="color: #89b4fa;">&gt;</span> take 0 <span style="color: #a6e3a1;">"Henning"</span>
<span style="color: #a6e3a1;">""</span>
ghci<span style="color: #89b4fa;">&gt;</span> take 3 <span style="color: #a6e3a1;">"Henning"</span>
<span style="color: #a6e3a1;">"Hen"</span>
ghci<span style="color: #89b4fa;">&gt;</span> drop 3 <span style="color: #a6e3a1;">"Henning"</span>
<span style="color: #a6e3a1;">"ning"</span>
ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #a6e3a1;">"Henning"</span> <span style="color: #89dceb;">!!</span> 2
<span style="color: #a6e3a1;">'n'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga06826b" class="outline-3">
<h3 id="orga06826b"><span class="section-number-3">1.15.</span> Totality and safety</h3>
<div class="outline-text-3" id="text-1-15">
<p>
What happens when you run the following in GHCi:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #a6e3a1;">"yo"</span> <span style="color: #89dceb;">!!</span> 2
</pre>
</div>

<p>
Let's examine the type of <code>!!</code>; as expected, its a function from a list of \(a\)s, to an integer, to an \(a\).
</p>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #89b4fa;">!!</span>) <span style="color: #89dceb;">::</span> [a] <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Int</span> <span style="color: #89dceb;">-&gt;</span> a
</pre>
</div>

<p>
Note however, that this isn't a <i>total</i> function; there are some lists and integers for which this function will be undefined.
</p>

<p>
Partial functions in haskell are considered <i>unsafe</i>, because the type system doesn't prevent us from providing an illicit value as an argument to the function.
</p>
</div>
</div>

<div id="outline-container-org1efd1fe" class="outline-3">
<h3 id="org1efd1fe"><span class="section-number-3">1.16.</span> A note on safety</h3>
<div class="outline-text-3" id="text-1-16">
<p>
In Haskell, it's good practice to avoid unsafe functions wherever possible.
</p>

<p>
This is because the type-checker is an extremely powerful programming aid - if a program type-checks successfully, we can generally be reasonably sure that it will run without any errors and give back a sensible result.
</p>

<p>
This promise only holds just so long as we use <i>total</i> functions. There is some neat type-level machinery in haskell to rewrite functions like <code>(!!)</code> as total functions which we'll learn about later in the semester!
</p>
</div>
</div>

<div id="outline-container-orga5844f5" class="outline-3">
<h3 id="orga5844f5"><span class="section-number-3">1.17.</span> Building lists with <code>cons</code></h3>
<div class="outline-text-3" id="text-1-17">
<p>
The final list manipulation function we'll look at is an important one: <code>cons</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #a6e3a1;">'h'</span> <span style="color: #cba6f7;">:</span> <span style="color: #cba6f7;">[]</span>
[h]
ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #a6e3a1;">'h'</span> <span style="color: #cba6f7;">:</span> <span style="color: #a6e3a1;">"enning"</span>
<span style="color: #a6e3a1;">"henning"</span>
</pre>
</div>

<p>
In haskell, lists are built up by successive application of <code>cons</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #a6e3a1;">'h'</span> <span style="color: #cba6f7;">:</span> (<span style="color: #a6e3a1;">'e'</span> <span style="color: #cba6f7;">:</span> (<span style="color: #a6e3a1;">'n'</span> <span style="color: #cba6f7;">:</span> (<span style="color: #a6e3a1;">'n'</span> <span style="color: #cba6f7;">:</span> (<span style="color: #a6e3a1;">'i'</span> <span style="color: #cba6f7;">:</span> (<span style="color: #a6e3a1;">'n'</span> <span style="color: #cba6f7;">:</span> (<span style="color: #a6e3a1;">'g'</span> <span style="color: #cba6f7;">:</span> <span style="color: #cba6f7;">[]</span>))))))
</pre>
</div>

<p>
Since <code>:</code> is right associative we can drop the parentheses.
</p>

<p>
Lists in haskell are therefore <i>singly-linked lists of characters</i>.
</p>
</div>
</div>

<div id="outline-container-orgdb81b63" class="outline-3">
<h3 id="orgdb81b63"><span class="section-number-3">1.18.</span> Singly-linked lists</h3>
<div class="outline-text-3" id="text-1-18">
</div>
</div>

<div id="outline-container-orgd189a05" class="outline-3">
<h3 id="orgd189a05"><span class="section-number-3">1.19.</span> An aside on performance</h3>
<div class="outline-text-3" id="text-1-19">
<ul class="org-ul">
<li>For most industrial applications, singly-linked lists of chars would be a terrible choice.</li>
<li>On the other hand, this means that strings "come for free" on the basis of chars and extremely general list manipulation functions.</li>
<li>For anything we do in this class, performance won't be an issue. For serious work with strings, the standard is the Haskell <code>text</code> library.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org57e9831" class="outline-2">
<h2 id="org57e9831"><span class="section-number-2">2.</span> Prolegomenon to types</h2>
<div class="outline-text-2" id="text-2">
</div>
