handouts/types-and-strings.org
** The simply-typed lambda calculus

- Types are syntactic categories used to restrict what counts as a valid expression.
- Basic ingredients:
  * A set of primitive types.
  * A recursive rule for constructing complex (i.e., functional) types.
  * Rules for computing the type of a complex expression from the types of its parts.
    
** Primitive types

- Let's keep things simple, and start with just two primitive types:

\[\mathbf{Typ} := \{\mathtt{Int},\mathtt{Bool}\}\]

- We'll assume that integers are possible values and have the type ~Int~:
  
\[73 :: \mathtt{Int}\]

- We'll also assume two primitive values with the type ~Bool~:

\[\mathbf{true} :: \mathtt{Bool}, \mathbf{false} :: \mathtt{Bool}\]

** Functional types

We'll now state a recursive rule for complex (functional) types, using the Haskell convention for types.

- If \(\mathtt{a} \in \mathbf{Typ}\), then \(\mathtt{a}\) is a type. 
- If \(\mathtt{a}\) is a type, and \(\mathtt{b}\) is a type, then \(\mathtt{a \to  b}\) is a type.
- Nothing else is a type.

This means that we have many complex types like the following:

- \(\mathtt{(Bool \to Bool) \to Int}\)
- \(\mathtt{Int \to Int}\)
  
** Functions and their types

- We can assign some useful operations their types:

  \[(+) :: \mathtt{Int \to Int \to Int}\]
  \[(-) :: \mathtt{Int \to Int \to Int}\]
  \[\mathbf{factorial} :: \mathtt{Int \to Int}\]
  \[\mathbf{odd} :: \mathtt{Int \to Bool}\]
  \[\mathbf{even} :: \mathtt{Int \to Bool}\]
  \[\mathbf{and} :: \mathtt{Bool \to Bool \to Bool}\]

** Types of complex expressions  

*Functional applications*: Let \(\beta  :: \mathtt{a \to b}\), \(\alpha :: \mathtt{a}\) be an expression of the SLTC. \(\beta(\alpha)\) is an expression of type \(\mathtt{b}\).

*Abstractions:* Let \(\beta :: \mathtt{b}\) be an expression of the SLTC, and \(v\) a variable of type \(\mathtt{a}\). \(\lambda v . \beta \) is an expression of type \(\mathtt{a \to b}\).

** Exercise

Can you infer the types of the following expressions? Go step by step.

\[\mathbf{and}(\mathbf{odd}(4))(t)\]

\[\lambda x . \mathbf{odd}(\mathbf{factorial}(x))\]

\[\lambda f . f(\lambda x . (+)(x)(2))\]

** Type inference

Often, you can /infer/ the type of an expression without specifying the type of all of its sub-parts.

When you try to compile a haskell source file, or evaluate an expression in GHCi, the compiler will attempt to check that it is well-typed, by inferring the types of any expressions that don't have an explicit type provided.

Since haskell's type system is more expressive than we have here, the type-inference algorithm is quite complicated (the compiler is based on an algorithm called /Hindley-Milner/).

** Restrictions of a first-order type system

In a first order type-system, we can only state typed identity functions. What is the type of /the/ identity function?

\[\lambda x. x :: ?\]

** Restrictions of a first-order type system cont.

Consider the following functions:

\[\mathbf{not} :: \mathtt{Bool \to Bool}\]
\[\mathbf{not'} :: \lambda f . \lambda x . \mathbf{not}(f(x))\]
\[\mathbf{not''} :: \lambda r . \lambda x . \lambda y .  \mathbf{not}(r(x)(y))\]

- What are the types of *not'* and *not''*?
- Is there a way of expressing all three functions as a single-operation? If not, why not?
  
** Bonus: recursion

Remember the expression \(\omega\):

\[(\lambda x . x x) (\lambda x . x x)\]

- Try to give it a concrete type.
- This problem is related to the lack of Turing completeness of the SLTC.
- On the other hand, because the SLTC is relatively constrained it has some extremely nice logical properties:
  * The SLTC is a sound and complete logic.
  * /Type-checking/ (checking whether an expression is well-typed), and /type inference/ are *decidable*.
    
* Types in haskell

** Types we've seen so far

Some of the primitive types we've seen so far:

- ~Int~
- ~Char~
- ~[Char]~
- ~String~
- ~Bool~
  
** Data declarations

*Data decalarations* are declarations used for defining /types/.

We call the values that inhabit the type they are defined in *data constructors*.

** Sum types

The simplest kind of data declaration we see in Haskell is for a *sum type*. Consider the data declaration for ~Bool~:

#+begin_src haskell
  data Bool = False | True
#+end_src

The name immediately following the ~data~ keyword is the name of the type, which shows up in type signatures.

The /data constructors/ follow the equals sign; sum types are declared by separating the constructors with ~|~, which stands in for logical disjunction.

** Using GHCi

You can inspect the data declaration associated with a particular type by using the ~:i~ command in GHCi.

#+begin_src haskell
  ghci> :i Bool
  type Bool :: *
  data Bool = False | True
  -- ...
#+end_src

Depending on the version of ghc, this will also give you a bunch of extraneous information (the first line is the /kind signature/, and after the data decalaration we have information about /type classes/ - we'll learn about these later).

** Declaring your own datatypes

It's easy to declare your own sum types in haskell. Consider the following:

#+begin_src haskell
  data E = John | Mary | Bill | Sue
#+end_src

This declares a new type ~E~ whose inhabitants are all (and only) the values ~John~, ~Mary~, ~Bill~, ~Sue~.

