docs/types-and-strings.html
<div id="outline-container-org7ec30ed" class="outline-3">
<h3 id="org7ec30ed"><span class="section-number-3">2.1.</span> The simply-typed lambda calculus</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Types are syntactic categories used to restrict what counts as a valid expression.</li>
<li>Basic ingredients:
<ul class="org-ul">
<li>A set of primitive types.</li>
<li>A recursive rule for constructing complex (i.e., functional) types.</li>
<li>Rules for computing the type of a complex expression from the types of its parts.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc17a76a" class="outline-3">
<h3 id="orgc17a76a"><span class="section-number-3">2.2.</span> Primitive types</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Let's keep things simple, and start with just two primitive types:</li>
</ul>

<p>
\[\mathbf{Typ} := \{\mathtt{Int},\mathtt{Bool}\}\]
</p>

<ul class="org-ul">
<li>We'll assume that integers are possible values and have the type <code>Int</code>:</li>
</ul>

<p>
\[73 :: \mathtt{Int}\]
</p>

<ul class="org-ul">
<li>We'll also assume two primitive values with the type <code>Bool</code>:</li>
</ul>

<p>
\[\mathbf{true} :: \mathtt{Bool}, \mathbf{false} :: \mathtt{Bool}\]
</p>
</div>
</div>

<div id="outline-container-org9d008b7" class="outline-3">
<h3 id="org9d008b7"><span class="section-number-3">2.3.</span> Functional types</h3>
<div class="outline-text-3" id="text-2-3">
<p>
We'll now state a recursive rule for complex (functional) types, using the Haskell convention for types.
</p>

<ul class="org-ul">
<li>If \(\mathtt{a} \in \mathbf{Typ}\), then \(\mathtt{a}\) is a type.</li>
<li>If \(\mathtt{a}\) is a type, and \(\mathtt{b}\) is a type, then \(\mathtt{a \to  b}\) is a type.</li>
<li>Nothing else is a type.</li>
</ul>

<p>
This means that we have many complex types like the following:
</p>

<ul class="org-ul">
<li>\(\mathtt{(Bool \to Bool) \to Int}\)</li>
<li>\(\mathtt{Int \to Int}\)</li>
</ul>
</div>
</div>

<div id="outline-container-org3d772c5" class="outline-3">
<h3 id="org3d772c5"><span class="section-number-3">2.4.</span> Functions and their types</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><p>
We can assign some useful operations their types:
</p>

<p>
\[(+) :: \mathtt{Int \to Int \to Int}\]
\[(-) :: \mathtt{Int \to Int \to Int}\]
\[\mathbf{factorial} :: \mathtt{Int \to Int}\]
\[\mathbf{odd} :: \mathtt{Int \to Bool}\]
\[\mathbf{even} :: \mathtt{Int \to Bool}\]
\[\mathbf{and} :: \mathtt{Bool \to Bool \to Bool}\]
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org9f84dd2" class="outline-3">
<h3 id="org9f84dd2"><span class="section-number-3">2.5.</span> Types of complex expressions</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<b>Functional applications</b>: Let \(\beta  :: \mathtt{a \to b}\), \(\alpha :: \mathtt{a}\) be an expression of the STLC. \(\beta(\alpha)\) is an expression of type \(\mathtt{b}\).
</p>

<p>
<b>Abstractions:</b> Let \(\beta :: \mathtt{b}\) be an expression of the STLC, and \(v\) a variable of type \(\mathtt{a}\). \(\lambda v . \beta \) is an expression of type \(\mathtt{a \to b}\).
</p>
</div>
</div>

<div id="outline-container-orgd074644" class="outline-3">
<h3 id="orgd074644"><span class="section-number-3">2.6.</span> Exercise</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Can you infer the types of the following expressions? Go step by step.
</p>

<p>
\[\mathbf{and}(\mathbf{odd}(4))(t)\]
</p>

<p>
\[\lambda x . \mathbf{odd}(\mathbf{factorial}(x))\]
</p>

<p>
\[\lambda f . f(\lambda x . (+)(x)(2))\]
</p>
</div>
</div>

<div id="outline-container-orgee40287" class="outline-3">
<h3 id="orgee40287"><span class="section-number-3">2.7.</span> Type inference</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Often, you can <i>infer</i> the type of an expression without specifying the type of all of its sub-parts.
</p>

<p>
When you try to compile a haskell source file, or evaluate an expression in GHCi, the compiler will attempt to check that it is well-typed, by inferring the types of any expressions that don't have an explicit type provided.
</p>

<p>
Since haskell's type system is more expressive than we have here, the type-inference algorithm is quite complicated (the compiler is based on an algorithm called <i>Hindley-Milner</i>).
</p>
</div>
</div>

<div id="outline-container-org35c3784" class="outline-3">
<h3 id="org35c3784"><span class="section-number-3">2.8.</span> Restrictions of a first-order type system</h3>
<div class="outline-text-3" id="text-2-8">
<p>
In a first order type-system, we can only state typed identity functions. What is the type of <i>the</i> identity function?
</p>

<p>
\[\lambda x. x :: ?\]
</p>
</div>
</div>

<div id="outline-container-org1e1a1f4" class="outline-3">
<h3 id="org1e1a1f4"><span class="section-number-3">2.9.</span> Restrictions of a first-order type system cont.</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Consider the following functions:
</p>

<p>
\[\mathbf{not} :: \mathtt{Bool \to Bool}\]
\[\mathbf{not'} :: \lambda f . \lambda x . \mathbf{not}(f(x))\]
\[\mathbf{not''} :: \lambda r . \lambda x . \lambda y .  \mathbf{not}(r(x)(y))\]
</p>

<ul class="org-ul">
<li>What are the types of <b>not'</b> and <b>not''</b>?</li>
<li>Is there a way of expressing all three functions as a single-operation? If not, why not?</li>
</ul>
</div>
</div>

<div id="outline-container-org1c1a066" class="outline-3">
<h3 id="org1c1a066"><span class="section-number-3">2.10.</span> Bonus: recursion</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Remember the expression \(\omega\):
</p>

<p>
\[(\lambda x . x x) (\lambda x . x x)\]
</p>

<ul class="org-ul">
<li>Try to give it a concrete type.</li>
<li>This problem is related to the lack of Turing completeness of the STLC.</li>
<li>On the other hand, because the STLC is relatively constrained it has some extremely nice logical properties:
<ul class="org-ul">
<li>The STLC is a sound and complete logic.</li>
<li><i>Type-checking</i> (checking whether an expression is well-typed), and <i>type inference</i> are <b>decidable</b>.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgee5b34b" class="outline-2">
<h2 id="orgee5b34b"><span class="section-number-2">3.</span> Types in haskell</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1fc4706" class="outline-3">
<h3 id="org1fc4706"><span class="section-number-3">3.1.</span> Types we've seen so far</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Some of the primitive types we've seen so far:
</p>

<ul class="org-ul">
<li><code>Int</code></li>
<li><code>Char</code></li>
<li><code>String</code></li>
<li><code>Bool</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgb79237f" class="outline-3">
<h3 id="orgb79237f"><span class="section-number-3">3.2.</span> Data declarations</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>Data decalarations</b> are declarations used for defining <i>types</i>.
</p>

<p>
We call the values that inhabit the type they are defined in <b>data constructors</b>.
</p>
</div>
</div>

<div id="outline-container-org96b531c" class="outline-3">
<h3 id="org96b531c"><span class="section-number-3">3.3.</span> Sum types</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The simplest kind of data declaration we see in Haskell is for a <b>sum type</b>. Consider the data declaration for <code>Bool</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #b4befe;">Bool</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">False</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">True</span>
</pre>
</div>

<p>
The name immediately following the <code>data</code> keyword is the name of the type, which shows up in type signatures.
</p>

<p>
The <i>data constructors</i> follow the equals sign; sum types are declared by separating the constructors with <code>|</code>, which stands in for logical disjunction.
</p>
</div>
</div>

<div id="outline-container-org2d93ea5" class="outline-3">
<h3 id="org2d93ea5"><span class="section-number-3">3.4.</span> Using GHCi</h3>
<div class="outline-text-3" id="text-3-4">
<p>
You can inspect the data declaration associated with a particular type by using the <code>:i</code> command in GHCi.
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">:</span>i <span style="color: #cba6f7;">Bool</span>
<span style="color: #cba6f7;">type</span> <span style="color: #b4befe;">Bool</span> <span style="color: #89dceb;">::</span> <span style="color: #89dceb;">*</span>
<span style="color: #cba6f7;">data</span> <span style="color: #b4befe;">Bool</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">False</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">True</span>
<span style="color: #585b70;">-- </span><span style="color: #585b70;">...</span>
</pre>
</div>

<p>
Depending on the version of ghc, this will also give you a bunch of extraneous information (the first line is the <i>kind signature</i>, and after the data decalaration we have information about <i>type classes</i> - we'll learn about these later).
</p>
</div>
</div>

<div id="outline-container-orgfefdc33" class="outline-3">
<h3 id="orgfefdc33"><span class="section-number-3">3.5.</span> Declaring your own datatypes</h3>
<div class="outline-text-3" id="text-3-5">
<p>
It's easy to declare your own sum types in haskell. Consider the following:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #b4befe;">E</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">John</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Mary</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Bill</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Sue</span>
</pre>
</div>

<p>
This declares a new type <code>E</code> whose inhabitants are all (and only) the values <code>John</code>, <code>Mary</code>, <code>Bill</code>, <code>Sue</code>.
</p>
</div>
</div>
