handouts/types-and-strings.org
** Pattern matching

We can define functions that take our new constructors as arguments by using /pattern matching/.

#+begin_src haskell
  isHappy :: E -> Bool
  isHappy Mary = True
  isHappy _ = False
#+end_src

Note that the underscore is interpreted as an /elsewhere/ condition.

What do you think the result of evaluating the following will be?

#+begin_src haskell
  not (isHappy John || isHappy Mary)
#+end_src

** Modelling composition: first steps

#+begin_export latex
\begin{center}
\begin{scriptsize}
\begin{forest}
  [{\texttt{False :: Bool}}
    [{\texttt{not :: Bool -> Bool}}]
    [{\texttt{True :: Bool}}
    [{\texttt{(False || True) :: Bool}}
    [{\texttt{(\backslash t -> False || t) :: Bool -> Bool}}
      [{\texttt{(||) :: Bool -> Bool -> Bool}}]
      [{\texttt{False :: Bool}}
        [{\texttt{isHappy :: E -> Bool}}]
        [{\texttt{John :: E}}]
      ]
    ]
      [{\texttt{True :: Bool}}
        [{\texttt{isHappy :: E -> Bool}}]
        [{\texttt{Mary :: E}}]
      ]
    ]
  ]]\end{forest}
  \end{scriptsize}
  \end{center}
#+end_export

** Higher-Order Abstract Syntax

Note: using Haskell's syntax to simulate aspects of the object-language syntax is known as /Higher-Order Abstract Syntax/.

We'll see more of this technique in the coming weeks.

** Basic typeclasses

Recall our basic type for individuals.

#+begin_src haskell
  data E = John | Mary | Bill | Sue
#+end_src

We haven't given ghc any further information about this type, so there's not much we can do with it. See what happens if you evaluate the following:

#+begin_src haskell
  John == John
#+end_src

What about the following:

#+begin_src haskell
  True == True
#+end_src

** Basic typeclasses cont.

The reason for the contrast here is that ~Bool~ by default is an instance of the type class ~Eq~, which is the class of types that contain things that can be compared and determined to be equal in value.

Since we didn't explicitly say that ~E~ is an instance of ~Eq~, ghc doesn't assume that it is.

Likewise, try evaluating the following in ghci:

#+begin_src haskell
  ghci> John
#+end_src

** Deriving typeclasses

We'll learn later how to declare typeclass instances, but in the mean time ghc has convenient mechanisms for automatically generating sensible typeclass instances for simple types.

 #+begin_src haskell
  data E = John | Mary | Bill | Sue deriving (Eq,Show)
#+end_src

** Constrained polymorphism

- Inspect the type of ~id~.
- Now inspect the type of ~(==)~, which is a function that tests for equality.
  * Polymorphism is used to constrain typeclasses.
  * The fewer typeclass constraints on a polymorphic type signature, the fewer assumptions the polymorphic function can make about its arguments.
    
** Using typeclasses

What do you think will happen if you declare the in a source file?

#+begin_src haskell
  same :: Eq a => a -> b -> Bool
  same a b = a == b
#+end_src

** Using typeclasses cont. 

Remember that free type variables are /implicitly universally quantified/.

#+begin_src haskell
  id :: a -> a
#+end_src

Informally, this means that the type of ~id~ is ~a -> a~, for all ~a~ in the set of types.
  
Type class constraints restrict the universal quantification to just types which belong to particular classes:

#+begin_src haskell
  (==) :: Eq => a -> a -> Bool
#+end_src

This means that the type of ~(==)~ is ~a -> a -> Bool~, for all ~a~ that belong to the ~Eq~ class.

** Combining typeclass restrictions

Typeclass restrictions can be combined. We've alluded to this before, but the typeclass ~Show~ is used to classify types whose inhabitants can be converted into strings (via the ~show~) function.

What does the following function do?

#+begin_src haskell
  func :: (Eq a, Show a) => a -> a -> String
  func a b = if 
    a == b
    then (show a) ++ " is equal to " ++ (show b)
    else "try again!"
#+end_src

** Sidenote: conditionals

Haskell has syntactic sugar for conditional states like /if A then B/, which are conventionally written as follows:

#+begin_src haskell
  if _condition then _expressionA else _expressionB
#+end_src

You can use conditionals anywhere where you could use ~_expressionA~ or ~_expressionB~ (the expressions must be of the same type).

What does the following function do?

#+begin_src haskell
toyFunc n = if even n then n + 1 else n - 1
#+end_src

