docs/types-and-strings.html

<div id="outline-container-orgf2ba7a8" class="outline-3">
<h3 id="orgf2ba7a8"><span class="section-number-3">3.6.</span> Pattern matching</h3>
<div class="outline-text-3" id="text-3-6">
<p>
We can define functions that take our new constructors as arguments by using <i>pattern matching</i>.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">isHappy</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">E</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Bool</span>
<span style="color: #89b4fa;">isHappy</span> <span style="color: #cba6f7;">Mary</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">True</span>
<span style="color: #89b4fa;">isHappy</span> <span style="color: #cba6f7;">_</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">False</span>
</pre>
</div>

<p>
Note that the underscore is interpreted as an <i>elsewhere</i> condition.
</p>

<p>
What do you think the result of evaluating the following will be?
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">not</span> (isHappy <span style="color: #cba6f7;">John</span> <span style="color: #89dceb;">||</span> isHappy <span style="color: #cba6f7;">Mary</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5f683f" class="outline-3">
<h3 id="orgb5f683f"><span class="section-number-3">3.7.</span> Modelling composition: first steps</h3>
<div class="outline-text-3" id="text-3-7">
</div>
</div>

<div id="outline-container-orga6c0aa2" class="outline-3">
<h3 id="orga6c0aa2"><span class="section-number-3">3.8.</span> Higher-Order Abstract Syntax</h3>
<div class="outline-text-3" id="text-3-8">
<p>
Note: using Haskell's syntax to simulate aspects of the object-language syntax is known as <i>Higher-Order Abstract Syntax</i>.
</p>

<p>
We'll see more of this technique in the coming weeks.
</p>
</div>
</div>

<div id="outline-container-org99bc38b" class="outline-3">
<h3 id="org99bc38b"><span class="section-number-3">3.9.</span> Basic typeclasses</h3>
<div class="outline-text-3" id="text-3-9">
<p>
Recall our basic type for individuals.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #b4befe;">E</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">John</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Mary</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Bill</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Sue</span>
</pre>
</div>

<p>
We haven't given ghc any further information about this type, so there's not much we can do with it. See what happens if you evaluate the following:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">John</span> <span style="color: #89b4fa;">==</span> <span style="color: #cba6f7;">John</span>
</pre>
</div>

<p>
What about the following:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">True</span> <span style="color: #89b4fa;">==</span> <span style="color: #cba6f7;">True</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2c99f9" class="outline-3">
<h3 id="orga2c99f9"><span class="section-number-3">3.10.</span> Basic typeclasses cont.</h3>
<div class="outline-text-3" id="text-3-10">
<p>
The reason for the contrast here is that <code>Bool</code> by default is an instance of the type class <code>Eq</code>, which is the class of types that contain things that can be compared and determined to be equal in value.
</p>

<p>
Since we didn't explicitly say that <code>E</code> is an instance of <code>Eq</code>, ghc doesn't assume that it is.
</p>

<p>
Likewise, try evaluating the following in ghci:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">John</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b8521d" class="outline-3">
<h3 id="org6b8521d"><span class="section-number-3">3.11.</span> Deriving typeclasses</h3>
<div class="outline-text-3" id="text-3-11">
<p>
We'll learn later how to declare typeclass instances, but in the mean time ghc has convenient mechanisms for automatically generating sensible typeclass instances for simple types.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #b4befe;">E</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">John</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Mary</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Bill</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Sue</span> <span style="color: #cba6f7;">deriving</span> (<span style="color: #cba6f7;">Eq</span>,<span style="color: #cba6f7;">Show</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org19083ab" class="outline-3">
<h3 id="org19083ab"><span class="section-number-3">3.12.</span> Constrained polymorphism</h3>
<div class="outline-text-3" id="text-3-12">
<ul class="org-ul">
<li>Inspect the type of <code>id</code>.</li>
<li>Now inspect the type of <code>(==)</code>, which is a function that tests for equality.
<ul class="org-ul">
<li>Polymorphism is used to constrain typeclasses.</li>
<li>The fewer typeclass constraints on a polymorphic type signature, the fewer assumptions the polymorphic function can make about its arguments.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge9c40a1" class="outline-3">
<h3 id="orge9c40a1"><span class="section-number-3">3.13.</span> Using typeclasses</h3>
<div class="outline-text-3" id="text-3-13">
<p>
What do you think will happen if you declare the in a source file?
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">same</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">Eq</span> a <span style="color: #89dceb;">=&gt;</span> a <span style="color: #89dceb;">-&gt;</span> b <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Bool</span>
<span style="color: #89b4fa;">same</span> a b <span style="color: #89dceb;">=</span> a <span style="color: #89dceb;">==</span> b
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7fb758" class="outline-3">
<h3 id="orgc7fb758"><span class="section-number-3">3.14.</span> Using typeclasses cont.</h3>
<div class="outline-text-3" id="text-3-14">
<p>
Remember that free type variables are <i>implicitly universally quantified</i>.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">id</span> <span style="color: #89dceb;">::</span> a <span style="color: #89dceb;">-&gt;</span> a
</pre>
</div>

<p>
Informally, this means that the type of <code>id</code> is <code>a -&gt; a</code>, for all <code>a</code> in the set of types.
</p>

<p>
Type class constraints restrict the universal quantification to just types which belong to particular classes:
</p>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #89b4fa;">==</span>) <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">Eq</span> <span style="color: #89dceb;">=&gt;</span> a <span style="color: #89dceb;">-&gt;</span> a <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Bool</span>
</pre>
</div>

<p>
This means that the type of <code>(==)</code> is <code>a -&gt; a -&gt; Bool</code>, for all <code>a</code> that belong to the <code>Eq</code> class.
</p>
</div>
</div>

<div id="outline-container-orgf3d561f" class="outline-3">
<h3 id="orgf3d561f"><span class="section-number-3">3.15.</span> Combining typeclass restrictions</h3>
<div class="outline-text-3" id="text-3-15">
<p>
Typeclass restrictions can be combined. We've alluded to this before, but the typeclass <code>Show</code> is used to classify types whose inhabitants can be converted into strings (via the <code>show</code>) function.
</p>

<p>
What does the following function do?
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">func</span> <span style="color: #89dceb;">::</span> (<span style="color: #b4befe;">Eq</span> a, <span style="color: #b4befe;">Show</span> a) <span style="color: #89dceb;">=&gt;</span> a <span style="color: #89dceb;">-&gt;</span> a <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">String</span>
<span style="color: #89b4fa;">func</span> a b <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">if</span> 
  a <span style="color: #89dceb;">==</span> b
  <span style="color: #cba6f7;">then</span> (show a) <span style="color: #89dceb;">++</span> <span style="color: #a6e3a1;">" is equal to "</span> <span style="color: #89dceb;">++</span> (show b)
  <span style="color: #cba6f7;">else</span> <span style="color: #a6e3a1;">"try again!"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2fd11af" class="outline-3">
<h3 id="org2fd11af"><span class="section-number-3">3.16.</span> Sidenote: conditionals</h3>
<div class="outline-text-3" id="text-3-16">
<p>
Haskell has syntactic sugar for conditional states like <i>if A then B</i>, which are conventionally written as follows:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">if</span> _condition <span style="color: #cba6f7;">then</span> _expressionA <span style="color: #cba6f7;">else</span> _expressionB
</pre>
</div>

<p>
You can use conditionals anywhere where you could use <code>_expressionA</code> or <code>_expressionB</code> (the expressions must be of the same type).
</p>

<p>
What does the following function do?
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">toyFunc</span> n <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">if</span> even n <span style="color: #cba6f7;">then</span> n <span style="color: #89dceb;">+</span> 1 <span style="color: #cba6f7;">else</span> n <span style="color: #89dceb;">-</span> 1
</pre>
</div>
</div>
</div>
